ErpTest/src/AccumulationRegisters/пкВыполненныеРаботы/пкВыполненныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>пкВыполненныеРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Командировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НочныеРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыходныеДни</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаряд</name>
    <type>
      <types>DocumentRef.пкЗаказНаряд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/пкСтатусыЗаказНарядов/пкСтатусыЗаказНарядов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыЗаказНарядов</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Открыт</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/AccumulationRegisters/пкВыполненныеРаботы/ManagerModule.bsl
Процедура СформироватьЗаписиПоДокументуЗаказНаряд(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкВыполненныеРаботы;
	НаборЗаписей.Записывать = Истина;
	СписокСтатусов = Новый Массив;
	СписокСтатусов.Добавить(Перечисления.пкСтатусыЗаказНарядов.Открыт);
	СписокСтатусов.Добавить(Перечисления.пкСтатусыЗаказНарядов.ВРаботе);
	СписокСтатусов.Добавить(Перечисления.пкСтатусыЗаказНарядов.Выполнен);
	СписокСтатусов.Добавить(Перечисления.пкСтатусыЗаказНарядов.Закрыт);
	СписокСтатусов.Добавить(Перечисления.пкСтатусыЗаказНарядов.Отложен);
	
	Если СписокСтатусов.Найти(тИсточник.Статус) <> Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	пкЗаказНарядРаботы.Ссылка КАК Регистратор,
		|	пкЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	пкЗаказНарядРаботы.ДатаОкончания КАК Период,
		|	пкЗаказНарядРаботы.Номенклатура КАК Работа,
		|	пкЗаказНарядРаботы.Сотрудник,
		|	пкЗаказНарядРаботы.Количество,
		|	пкЗаказНарядРаботы.СуммаСНДС КАК Сумма,
		|	пкЗаказНарядРаботы.ДатаНачала,
		|	пкЗаказНарядРаботы.ДатаОкончания,
		|	пкЗаказНарядРаботы.Командировка,
		|	пкЗаказНарядРаботы.НочныеРаботы,
		|	пкЗаказНарядРаботы.ВыходныеДни
		|ИЗ
		|	Документ.пкЗаказНаряд.Работы КАК пкЗаказНарядРаботы
		|ГДЕ
		|	пкЗаказНарядРаботы.Ссылка = &Ссылка
		|	И пкЗаказНарядРаботы.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)");
		Запрос.УстановитьПараметр("Ссылка",тИсточник.Ссылка);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда 
			НаборЗаписей.Загрузить(Результат.Выгрузить());
		КонецЕсли;
			
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
Процедура СформироватьЗаписи(Отказ, РежимПроведения, тИсточник) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсточников = Новый Массив;
	
	Если ТипЗнч(тИсточник) = Тип("Массив") Тогда
		МассивИсточников = тИсточник;
	Иначе
		МассивИсточников.Добавить(тИсточник);
	КонецЕсли;
	
	Для Каждого ЭлементИсточник из МассивИсточников Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкЗаказНаряд") Тогда
			СформироватьЗаписиПоДокументуЗаказНаряд(Отказ, РежимПроведения, ЭлементИсточник);	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
